#메소드(Method) = 클래스 내에 정의 된 어떤 동작, 기능을 하는 코드들의 묶음
s = '대덕소프트웨어마이스터고등학교'
# '대덕'으로 실행하는지?
print(s.startswith('대덕')) 
# >True
s = '대덕소프트웨어마이스터고등학교'
# '초등학교'으로 끝나는지?
print(s.endswith('초등학교')) 
# > Flase
s = '...대덕소프트웨어마이스터고등학교...'
#  앞뒤로 불필요한 부분?
print(s.strip('.')) 
# > 대덕소프트웨어마이스터고등학교
s = '...대덕소프트웨어마이스터고등학교...'
#  '고등학교'를 '고교'로?
print(s.replace('고등학교', '고교')) 
# > 대덕소프트웨어마이스터고교
s = '대덕소프트웨어마이스터고등학교'
#  '학교'라는 글자는 어디에?
print(s.find('학교')) 
# > 13
s = '대덕소프트웨어마이스터고등학교'
#  '학교'라는 글자는 어디에?
print(s.center(25, '*')***'
