#세트는 리스트와 튜플같이 여러 개의 데이터를 저장할 수 있지만 세트는 순서를 보장하지 않고 중복을 허용하지 않는다는 차이점이 있다.
#세트는 중괄호 속에 값들을 콤마(,)로 구분해서 넣을 수 있다.
A = {'돈가스', '보쌈', '우동'}
B = {'짬뽕', '우동', '짜장면'}
# 두 친구가 공통으로 좋아하는 음식? (교
print(A.intersection(B)) #intersection을 사용하면 {'우동']이 출력된다.
A = {'돈가스', '보쌈', '우동'}
B = {'짬뽕', '우동', '짜장면'}
# 두 친구가 좋아하는 음식 모두? (합집합)
print(A.union(B)) #union을 사용하면 {'돈가스', '보쌈', '우동', '짬뽕', '짜장면']이 출력된다.
A = {'돈가스', '보쌈', '우동'}
B = {'짬뽕', '우동', '짜장면'}
# B만 좋아하는 음식? (차집합)
print(A.difference(B)) #difference를 사용하면 {'짬뽕', '짜장면']이 출력된다.
